tests/load/artillery-comparison.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase - gradual increase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up phase"
    
    # Baseline testing - normal traffic
    - duration: 120
      arrivalRate: 20
      name: "Baseline comparison testing"
    
    # Sustained load - production-like traffic
    - duration: 180
      arrivalRate: 50
      name: "Sustained production load"
    
    # Peak load - high traffic scenarios
    - duration: 120
      arrivalRate: 100
      name: "Peak load testing"
    
    # Stress testing - beyond normal capacity
    - duration: 90
      arrivalRate: 150
      name: "Stress testing"
    
    # Recovery testing - back to normal
    - duration: 60
      arrivalRate: 30
      name: "Recovery testing"
  
  defaults:
    headers:
      Content-Type: 'application/json'
      Authorization: 'Bearer test-token-123'
    timeout: 30000

scenarios:
  # OPTIMIZED ENDPOINTS (50% of traffic)
  - name: "Driver Analytics - OPTIMIZED Endpoint 1"
    weight: 15
    flow:
      - get:
          url: "/api/v1/drivers/1/analytics"
          capture:
            - json: "$.driver_id"
              as: "driver_id"
            - json: "$.total_trips"
              as: "total_trips"
  
  - name: "Driver Analytics - OPTIMIZED Endpoint 2"
    weight: 12
    flow:
      - get:
          url: "/api/v1/drivers/2/analytics"
  
  - name: "Driver Analytics - OPTIMIZED Endpoint 3"
    weight: 10
    flow:
      - get:
          url: "/api/v1/drivers/3/analytics"
  
  - name: "Driver Analytics - OPTIMIZED Endpoint 4"
    weight: 8
    flow:
      - get:
          url: "/api/v1/drivers/4/analytics"
  
  - name: "Driver Analytics - OPTIMIZED Endpoint 5"
    weight: 5
    flow:
      - get:
          url: "/api/v1/drivers/5/analytics"

  # UNOPTIMIZED ENDPOINTS (50% of traffic)
  - name: "Driver Analytics - UNOPTIMIZED Endpoint 1"
    weight: 15
    flow:
      - get:
          url: "/api/v1/drivers/1/analytics/unoptimized"
          capture:
            - json: "$.driver_id"
              as: "driver_id"
            - json: "$.total_trips"
              as: "total_trips"
  
  - name: "Driver Analytics - UNOPTIMIZED Endpoint 2"
    weight: 12
    flow:
      - get:
          url: "/api/v1/drivers/2/analytics/unoptimized"
  
  - name: "Driver Analytics - UNOPTIMIZED Endpoint 3"
    weight: 10
    flow:
      - get:
          url: "/api/v1/drivers/3/analytics/unoptimized"
  
  - name: "Driver Analytics - UNOPTIMIZED Endpoint 4"
    weight: 8
    flow:
      - get:
          url: "/api/v1/drivers/4/analytics/unoptimized"
  
  - name: "Driver Analytics - UNOPTIMIZED Endpoint 5"
    weight: 5
    flow:
      - get:
          url: "/api/v1/drivers/5/analytics/unoptimized"

# Performance expectations for COMPARISON
expect:
  - statusCode: [200, 201, 404]
  # OPTIMIZED endpoints should be much faster
  - maxResponseTime: 3000  # 3 seconds max for optimized
  - p95ResponseTime: 1500  # 95% under 1.5 seconds for optimized
  # UNOPTIMIZED endpoints will be slower
  - maxResponseTime: 15000 # 15 seconds max for unoptimized
  - p95ResponseTime: 8000  # 95% under 8 seconds for unoptimized