tests/load/artillery-unoptimized-only.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase - gradual increase
    - duration: 120
      arrivalRate: 5
      name: "Warm-up phase"
    
    # Sustained load - normal production traffic
    - duration: 300
      arrivalRate: 50
      name: "Sustained production load"
    
    # Peak load - high traffic scenarios
    - duration: 180
      arrivalRate: 100
      name: "Peak load testing"
    
    # Stress testing - beyond normal capacity
    - duration: 120
      arrivalRate: 200
      name: "Stress testing"
    
    # Spike testing - sudden traffic bursts
    - duration: 60
      arrivalRate: 500
      name: "Traffic spike testing"
    
    # Recovery testing - back to normal
    - duration: 120
      arrivalRate: 30
      name: "Recovery testing"
  
  defaults:
    headers:
      Content-Type: 'application/json'
      Authorization: 'Bearer test-token-123'
    timeout: 30000

scenarios:
  # UNOPTIMIZED ENDPOINTS ONLY (100% of traffic)
  - name: "Driver Analytics - Unoptimized Endpoint 1"
    weight: 30
    flow:
      - get:
          url: "/api/v1/drivers/1/analytics/unoptimized"
  
  - name: "Driver Analytics - Unoptimized Endpoint 2"
    weight: 25
    flow:
      - get:
          url: "/api/v1/drivers/2/analytics/unoptimized"
  
  - name: "Driver Analytics - Unoptimized Endpoint 3"
    weight: 20
    flow:
      - get:
          url: "/api/v1/drivers/3/analytics/unoptimized"
  
  - name: "Driver Analytics - Unoptimized Endpoint 4"
    weight: 15
    flow:
      - get:
          url: "/api/v1/drivers/4/analytics/unoptimized"
  
  - name: "Driver Analytics - Unoptimized Endpoint 5"
    weight: 10
    flow:
      - get:
          url: "/api/v1/drivers/5/analytics/unoptimized"

# Custom metrics and thresholds for UNOPTIMIZED ENDPOINTS
expect:
  - statusCode: [200, 201, 404]
  - maxResponseTime: 10000  # 10 seconds max response time (unoptimized expected)
  - p95ResponseTime: 5000   # 95% of requests under 5 seconds (unoptimized expected)
  - p99ResponseTime: 8000   # 99% of requests under 8 seconds (unoptimized expected)